# Используем последний образ Alpine Linux как базовый для создания контейнера
FROM alpine:latest

# Обновляем пакеты и устанавливаем необходимые зависимости
RUN \
    # Обновляем список пакетов
    apk update \                
    # Обновляем все установленные пакеты
    && apk upgrade \            
    # Устанавливаем необходимые пакеты без использования кэша
    && apk add --no-cache \     
    # Устанавливаем nodejs и npm
    nodejs npm \
    # Заголовочные файлы ядра Linux
    linux-headers \             
    # Очищаем кэш пакетов, чтобы уменьшить размер контейнера
    && rm -rf /var/cache/apk/*


# Установливаем bun
RUN npm install -g bun

# Устанавливаем рабочую директорию в контейнере на /app
WORKDIR /app

# Копируем все файлы из текущей директории на хосте в рабочую директорию контейнера
COPY . .

# Открываем порт 8080, на котором будет работать сервер
EXPOSE 18080

# Указываем команду для запуска сервера при старте контейнера
ENTRYPOINT [ "bun", "./src/index.ts" ]